RuslanRussel/PSoC_6_MCU/libs/csdidac/cy_csdidac.h
* * <a href="https://www.cypress.com/products/modustoolbox-software-environment">
*   <b>ModusToolbox Software Environment, Quick Start Guide, Documentation,
*   and Videos</b></a>
*
* * <a href="https://github.com/cypresssemiconductorco"><b>CSDIDAC Middleware
*   Code Example for MBED OS</b></a>
*
* * <a href="https://github.com/cypresssemiconductorco"><b>CSDIDAC Middleware
*   Code Examples at GITHUB</b></a>
*
* * <a href="https://www.cypress.com/ModusToolboxDeviceConfig"><b>ModusToolbox
*   Device Configurator Tool Guide</b></a>
*
* * <a href="https://cypresssemiconductorco.github.io/capsense/capsense_api_reference_manual/html/index.html">
*   <b>CapSense Middleware API Reference Guide</b></a>
*
* * <a href="https://cypresssemiconductorco.github.io/csdadc/csdadc_api_reference_manual/html/index.html">
*   <b>CSDADC Middleware API Reference Guide</b></a>
*
* * <a href="https://github.com/cypresssemiconductorco.github.io/psoc6pdl/pdl_api_reference_manual/html/index.html">
*   <b>PDL API Reference</b></a>
*
* * <a href="https://www.cypress.com/documentation/technical-reference-manuals/psoc-6-mcu-psoc-63-ble-architecture-technical-reference">
*   <b>PSoC 6 Technical Reference Manual</b></a>
*
* * <a href="http://www.cypress.com/ds218787">
*   <b>PSoC 63 with BLE Datasheet Programmable System-on-Chip datasheet</b></a>
*
* * <a href="http://www.cypress.com"><b>Cypress Semiconductor</b></a>
*
* \note
* The links to another software component’s documentation (middleware and PDL) 
* point to GitHub to the latest available version of the software. 
* To get documentation of the specified version, download from GitHub and unzip 
* the component archive. The documentation is available in the <i>docs</i> folder.
*
* \defgroup group_csdidac_macros Macros
* \brief
* This section describes the CSDIDAC macros. These macros can be used for 
* checking a maximum IDAC code and a maximum IDAC output current.
* For detailed information about macros, see each macro description. 
*
* \defgroup group_csdidac_enums Enumerated types
* \brief
* Describes the enumeration types defined by the CSDIDAC. These enumerations 
* can be used for checking CSDIDAC functions' return status,
* for defining a CSDIDAC LSB and polarity, and for choosing IDAC for an 
* operation and defining its states.  For detailed information about
* enumerations, see each enumeration description. 
*
* \defgroup group_csdidac_data_structures Data Structures
* \brief
* Describes the data structures defined by the CSDIDAC. The CSDIDAC 
* middleware use structures for output channel pins, 
* middleware configuration, and context. The pin structure is included 
* in the configuration structure and both of them can be defined by the 
* user with the CSD personality in the Device Configurator or manually 
* if the user doesn't use ModusToolbox.
* The context structure contains a copy of the configuration structure 
* and current CSDIDAC middleware state data. The context 
* structure should be allocated by the user and be passed to all 
* CSDIDAC middleware functions. CSDIDAC middleware structure sizes 
* are shown in the table below:
*
* <table class="doxtable">
*   <tr><th>Structure</th><th>Size in bytes (w/o padding)</th></tr>
*   <tr>
*     <td>cy_stc_csdidac_pin_t</td>
*     <td>5</td>
*   </tr>
*   <tr>
*     <td>cy_stc_csdidac_config_t</td>
*     <td>23</td>
*   </tr>
*   <tr>
*     <td>cy_stc_csdidac_context_t</td>
*     <td>31</td>
*   </tr>
* </table>
*
* \defgroup group_csdidac_functions Functions
* \brief
* This section describes the CSDIDAC Function Prototypes.
*/

/******************************************************************************/


#if !defined(CY_CSDIDAC_H)
#define CY_CSDIDAC_H

#include "cy_device_headers.h"
#include "cy_csd.h"

#if defined(CY_IP_MXCSDV2)

/* The C binding of definitions to build with the C++ compiler. */
#ifdef __cplusplus
extern "C" {
#endif /* __cplusplus */


/**
* \addtogroup group_csdidac_macros
* \{
*/
/** Middleware major version */
#define CY_CSDIDAC_MW_VERSION_MAJOR             (2)

/** Middleware minor version */
#define CY_CSDIDAC_MW_VERSION_MINOR             (0)

/** CSDIDAC ID. The user can identify the CSDIDAC middleware error codes by this macro. */
#define CY_CSDIDAC_ID                           (CY_PDL_DRV_ID(0x44u))

/** 
* The CSDIDAC max code value. The user provides the code 
* parameter for the Cy_CSDIDAC_OutputEnableExt() function 
* in the range from 0u to CY_CSDIDAC_MAX_CODE.
*/
#define CY_CSDIDAC_MAX_CODE                     (127u)

/** 
* The CSDIDAC max output current value. The user provides 
* the value of the current parameter for the Cy_CSDIDAC_OutputEnable() 
* function in range from 0 to +/-(CY_CSDIDAC_MAX_CURRENT_NA).
*/
#define CY_CSDIDAC_MAX_CURRENT_NA               (609600uL)

/** \} group_csdidac_macros */

/***************************************
* Enumerated Types and Parameters
***************************************/
/**
* \addtogroup group_csdidac_enums
* \{
*/

/** CSDIDAC return enumeration type */
typedef enum
{
    CY_CSDIDAC_SUCCESS           = (0u),   
                                            /**< The operation executed successfully. */
    CY_CSDIDAC_BAD_PARAM         = (CY_CSDIDAC_ID + (uint32_t)CY_PDL_STATUS_ERROR + 1u),
                                            /**< 
                                             * An input parameter is invalid. 
                                             * The user checks whether all
                                             * the input parameters are valid.
                                             */
    CY_CSDIDAC_HW_BUSY           = (CY_CSDIDAC_ID + (uint32_t)CY_PDL_STATUS_ERROR + 2u),
                                            /**< 
                                             * The CSD HW block is busy, 
                                             * i.e. any of current channel (A or B) 
                                             * is enabled. 
                                             */
    CY_CSDIDAC_HW_LOCKED         = (CY_CSDIDAC_ID + (uint32_t)CY_PDL_STATUS_ERROR + 3u),
                                            /**< 
                                             * The CSD HW block is acquired and 
                                             * locked by other middleware 
                                             * or application. The CSDIDAC 
                                             * middleware waits for 
                                             * the CSD HW block release
                                             * to acquire it for use. 
                                             */
    CY_CSDIDAC_HW_FAILURE         = (CY_CSDIDAC_ID + (uint32_t)CY_PDL_STATUS_ERROR + 4u),
                                            /**<
                                             * A CSD HW block failure. The possible reasons:
                                             *  - No peripheral clock assigned to the CSD HW block.
                                             *  - Peripheral clock assigned to the CSD HW block is disabled.
                                             *  - The CSD HW clock frequency is less than 100 kHz.
                                             *  - The configuration CSD HW block registers are corrupted.
                                             *  - The CSD HW block is damaged.
                                             */
    CY_CSDIDAC_BAD_CONFIGURATION  = (CY_CSDIDAC_ID + (uint32_t)CY_PDL_STATUS_ERROR + 5u),
                                            /**<
                                             * The CSDIDAC configuration structure initialization issue.
                                             * The possible reasons:
                                             *  - The base pointer is initialized with NULL.
                                             *  - The csdCxtPtr pointer is initialized with NULL.
                                             *  - The configA or configB fields are not enumerators of the
                                             *    \ref cy_en_csdidac_channel_config_t type.
                                             *  - The ptrPinA (ptrPinB) field is initialized with NULL
                                             *    when configA (configB) is initialized with \ref CY_CSDIDAC_GPIO.
                                             *  - The configA and configB fields are initialized with \ref CY_CSDIDAC_DISABLED
                                             *    simultaneously.
                                             *  - The configA and configB fields are initialized with \ref CY_CSDIDAC_JOIN
                                             *    simultaneously.
                                             *  - The configA (configB) field is initialized with \ref CY_CSDIDAC_JOIN
                                             *    when configB (configA) is initialized with \ref CY_CSDIDAC_DISABLED.
                                             */
} cy_en_csdidac_status_t;

/**
* The CSDIDAC output current LSB enumeration type. The user can choose 
* LSB when the Cy_CSDIDAC_OutputEnableExt() function is called and
* can check which LSB was chosen by the Cy_CSDIDAC_OutputEnable() 
* function in the cy_stc_csdidac_context_t structure.
*/

