RuslanRussel/PSoC_6_MCU/libs/csdidac/cy_csdidac.h
typedef enum
{ 
    CY_CSDIDAC_LSB_37_IDX   = 0u,           /**< Index for 37.5 nA LSB */
    CY_CSDIDAC_LSB_75_IDX   = 1u,           /**< Index for 75.0 nA LSB */
    CY_CSDIDAC_LSB_300_IDX  = 2u,           /**< Index for 0.3 uA LSB */
    CY_CSDIDAC_LSB_600_IDX  = 3u,           /**< Index for 0.6 uA LSB */
    CY_CSDIDAC_LSB_2400_IDX = 4u,           /**< Index for 2.4 uA LSB */
    CY_CSDIDAC_LSB_4800_IDX = 5u,           /**< Index for 4.8 uA LSB */
}cy_en_csdidac_lsb_t;

/**
* The CSDIDAC polarity enumeration type. The user can choose the polarity 
* when the Cy_CSDIDAC_OutputEnableExt() function is called and can 
* check which polarity was chosen by the Cy_CSDIDAC_OutputEnable() 
* function in the cy_stc_csdidac_context_t structure.
*/
typedef enum
{
    CY_CSDIDAC_SOURCE       = 0u,           /**< Source polarity */
    CY_CSDIDAC_SINK         = 1u,           /**< Sink polarity */
}cy_en_csdidac_polarity_t;

/**
* The CSDIDAC channel enabling enumeration type. The user can check which 
* channel (A or B or both) is currently enabled 
* in the cy_stc_csdidac_context_t structure.
*/
typedef enum
{
    CY_CSDIDAC_DISABLE      = 0u,           /**< The channel is disabled. */
    CY_CSDIDAC_ENABLE       = 1u,           /**< The channel is enabled. */
}cy_en_csdidac_state_t;

/**
* The CSDIDAC choosing enumeration type. The user can choose channel A or B 
* to operate with the Cy_CSDIDAC_OutputEnableExt(), Cy_CSDIDAC_OutputDisable(), 
* or Cy_CSDIDAC_OutputEnable() functions.
*/
typedef enum
{
  CY_CSDIDAC_A              = 0uL,          /**< The IDAC A is chosen for an operation */
  CY_CSDIDAC_B              = 1uL,          /**< The IDAC B is chosen for an operation */
  CY_CSDIDAC_AB             = 2uL,          /**< Both IDACs are chosen for an operation */
} cy_en_csdidac_choice_t;

/**
* The CSDIDAC channel configuration defines either disabled or enabled with 
* specific routing.
*/
typedef enum
{
    CY_CSDIDAC_DISABLED   = 0u,             /**< The IDAC channel is disabled. */
    CY_CSDIDAC_GPIO       = 1u,             /**< The IDAC channel is enabled and routed to a pin. */
    CY_CSDIDAC_AMUX       = 2u,             /**< The IDAC channel is enabled and routed to a corresponding analog bus. */
    CY_CSDIDAC_JOIN       = 3u,             /**< The IDAC channel is enabled and routed to the other IDAC channel. */
}cy_en_csdidac_channel_config_t;

/** \} group_csdidac_enums */


/***************************************
* Data Structure Definitions
***************************************/
/**
* \addtogroup group_csdidac_data_structures
* \{
*/

/** The CSDIDAC pin structure. */
typedef struct {
    GPIO_PRT_Type * ioPcPtr;                /**< The pointer to the channel IO PC register. */
    uint8_t pin;                            /**< The channel IO pin. */
} cy_stc_csdidac_pin_t;

/** The CSDIDAC configuration structure */
typedef struct
{
    CSD_Type * base;                        /**< The pointer to the CSD HW Block. */
    cy_stc_csd_context_t * csdCxtPtr;       /**< The pointer to the context of the CSD driver. */
    cy_en_csdidac_channel_config_t configA; /**< The IDAC A channel configuration. */
    cy_en_csdidac_channel_config_t configB; /**< The IDAC B channel configuration. */
    const cy_stc_csdidac_pin_t * ptrPinA;   /**< The pointer to the IDAC A pin structure. */
    const cy_stc_csdidac_pin_t * ptrPinB;   /**< The pointer to the IDAC B pin structure. */
    uint32_t cpuClk;                        /**< CPU Clock in Hz. */
    uint8_t csdInitTime;                    /**< The CSD HW Block initialization time. */
} cy_stc_csdidac_config_t;

/** The CSDIDAC context structure, that contains the internal middleware data. */
typedef struct{
    cy_stc_csdidac_config_t cfgCopy;        /**< A configuration structure copy. */
    cy_en_csdidac_polarity_t polarityA;     /**< The current IdacA polarity. */
    cy_en_csdidac_lsb_t lsbA;               /**< The current IdacA LSB. */
    uint8_t codeA;                          /**< The current IdacA code. */
    cy_en_csdidac_state_t channelStateA;    /**< The IDAC channel A is enabled. */
    cy_en_csdidac_polarity_t polarityB;     /**< The current IdacB polarity. */
    cy_en_csdidac_lsb_t lsbB;               /**< The current IdacB LSB. */
    uint8_t codeB;                          /**< The current IdacB code. */
    cy_en_csdidac_state_t channelStateB;    /**< The IDAC channel B is enabled. */
}cy_stc_csdidac_context_t;

/** \} group_csdidac_data_structures */


/*******************************************************************************
* Function Prototypes
*******************************************************************************/

/**
* \addtogroup group_csdidac_functions
* \{
*/
cy_en_csdidac_status_t Cy_CSDIDAC_Init(
                const cy_stc_csdidac_config_t * config,
                cy_stc_csdidac_context_t * context);
cy_en_csdidac_status_t Cy_CSDIDAC_DeInit(
                cy_stc_csdidac_context_t * context);
cy_en_csdidac_status_t Cy_CSDIDAC_WriteConfig(
                const cy_stc_csdidac_config_t * config,
                cy_stc_csdidac_context_t * context);
cy_en_csdidac_status_t Cy_CSDIDAC_Wakeup(
                const cy_stc_csdidac_context_t * context);
cy_en_syspm_status_t Cy_CSDIDAC_DeepSleepCallback(
                cy_stc_syspm_callback_params_t * callbackParams,
                cy_en_syspm_callback_mode_t mode);
cy_en_csdidac_status_t Cy_CSDIDAC_Save(
                cy_stc_csdidac_context_t * context);
cy_en_csdidac_status_t Cy_CSDIDAC_Restore(
                cy_stc_csdidac_context_t * context);
cy_en_csdidac_status_t Cy_CSDIDAC_OutputEnable(
                cy_en_csdidac_choice_t ch,
                int32_t current,
                cy_stc_csdidac_context_t * context);
cy_en_csdidac_status_t Cy_CSDIDAC_OutputEnableExt(
                cy_en_csdidac_choice_t outputCh,
                cy_en_csdidac_polarity_t polarity,
                cy_en_csdidac_lsb_t lsbIndex,
                uint32_t idacCode,
                cy_stc_csdidac_context_t * context);
cy_en_csdidac_status_t Cy_CSDIDAC_OutputDisable(
                cy_en_csdidac_choice_t ch,
                cy_stc_csdidac_context_t * context);

