RuslanRussel/PSoC_6_MCU/libs/csdidac/cy_csdidac.h
/** \} group_csdidac_functions */


/*******************************************************************************
* Function Name: Cy_CSDIDAC_IsIdacLsbValid
****************************************************************************//**
*
* Performs verification if the value passed through the idacLsbVal
* parameter is the enumerator of the \ref cy_en_csdidac_lsb_t type.
*
* \param idacLsbVal
* The input value for verification.
*
* \return status
* Returns the verification status:
* - true  - Indicates that the verification succeeded.
* - false - Indicates that the verification failed.
*
*******************************************************************************/
__STATIC_INLINE bool Cy_CSDIDAC_IsIdacLsbValid(cy_en_csdidac_lsb_t idacLsbVal)
{
    bool retVal;

    switch(idacLsbVal)
    {
        case CY_CSDIDAC_LSB_37_IDX:
        case CY_CSDIDAC_LSB_75_IDX:
        case CY_CSDIDAC_LSB_300_IDX:
        case CY_CSDIDAC_LSB_600_IDX:
        case CY_CSDIDAC_LSB_2400_IDX:
        case CY_CSDIDAC_LSB_4800_IDX:
            retVal = true;
            break;

        default:
            retVal = false;
            break;
    }

    return(retVal);
}


/*******************************************************************************
* Function Name: Cy_CSDIDAC_IsIdacPolarityValid
****************************************************************************//**
*
* Performs verification if the value passed through the idacPolarityVal
* parameter is the enumerator of the \ref cy_en_csdidac_polarity_t type.
*
* \param idacPolarityVal
* The input value for verification.
*
* \return status
* Returns the verification status:
* - true  - Indicates that the verification succeeded.
* - false - Indicates that the verification failed.
*
*******************************************************************************/
__STATIC_INLINE bool Cy_CSDIDAC_IsIdacPolarityValid(cy_en_csdidac_polarity_t idacPolarityVal)
{
    bool retVal;

    switch(idacPolarityVal)
    {
        case CY_CSDIDAC_SOURCE:
        case CY_CSDIDAC_SINK:
            retVal = true;
            break;

        default:
            retVal = false;
            break;
    }

    return(retVal);
}


/*******************************************************************************
* Function Name: Cy_CSDIDAC_IsIdacChoiceValid
****************************************************************************//**
*
* Performs verification if the value passed through the idacChoiceVal
* parameter is the enumerator of the \ref cy_en_csdidac_choice_t type.
*
* Performs verification that both IDACs are not disabled if CY_CSDIDAC_AB is
* passed through the idacChoiceVal parameter.
*
* \param idacChoiceVal
* The input value for verification.
*
* \param idacAConfigVal
* The IDACA channel configuration.
*
* \param idacBConfigVal
* The IDACB channel configuration.
*
* \return status
* Returns the verification status:
* - true  - Indicates that the verification succeeded.
* - false - Indicates that the verification failed.
*
*******************************************************************************/
__STATIC_INLINE bool Cy_CSDIDAC_IsIdacChoiceValid(cy_en_csdidac_choice_t idacChoiceVal,
                                                  cy_en_csdidac_channel_config_t idacAConfigVal,
                                                  cy_en_csdidac_channel_config_t idacBConfigVal)
{
    bool retVal;

    switch(idacChoiceVal)
    {
        case CY_CSDIDAC_A:
        case CY_CSDIDAC_B:
            retVal = true;
            break;
        case CY_CSDIDAC_AB:
            if((CY_CSDIDAC_DISABLED != idacAConfigVal) &&
               (CY_CSDIDAC_DISABLED != idacBConfigVal))
            {
                retVal = true;
            }
            else
            {
                retVal = false;
            }
            break;

        default:
            retVal = false;
            break;
    }

    return(retVal);
}


/*******************************************************************************
* Function Name: Cy_CSDIDAC_IsIdacChConfigValid
****************************************************************************//**
*
* Performs verification if the value passed through the idacChConfigVal
* parameter is the enumerator of the \ref cy_en_csdidac_channel_config_t type.
*
* \param idacChConfigVal
* The input value for verification.
*
* \return status
* Returns the verification status:
* - true  - Indicates that the verification succeeded.
* - false - Indicates that the verification failed.
*
*******************************************************************************/
__STATIC_INLINE bool Cy_CSDIDAC_IsIdacChConfigValid(cy_en_csdidac_channel_config_t idacChConfigVal)
{
    bool retVal;

    switch(idacChConfigVal)
    {
        case CY_CSDIDAC_DISABLED:
        case CY_CSDIDAC_GPIO:
        case CY_CSDIDAC_AMUX:
        case CY_CSDIDAC_JOIN:
            retVal = true;
            break;

        default:
            retVal = false;
            break;
    }

    return(retVal);
}


/*******************************************************************************
* Function Name: Cy_CSDIDAC_IsIdacConfigValid
****************************************************************************//**
*
* Performs verification of the CSDIDAC data structure initialization.
*
* \param config
* The pointer to the CSDIDSC configuration structure \ref cy_stc_csdidac_config_t.
*
* \return status
* Returns the verification status:
* - true  - Indicates that the verification succeeded.
* - false - Indicates that the verification failed.
*
*******************************************************************************/
__STATIC_INLINE bool Cy_CSDIDAC_IsIdacConfigValid(const cy_stc_csdidac_config_t * config)
{
    bool retVal = true;

    if((NULL != config->base) && (NULL != config->csdCxtPtr))
    {
        if(((CY_CSDIDAC_GPIO == config->configA) && (NULL == config->ptrPinA)) ||
           ((CY_CSDIDAC_GPIO == config->configB) && (NULL == config->ptrPinB)) ||
           ((CY_CSDIDAC_DISABLED == config->configA) && (CY_CSDIDAC_DISABLED == config->configB)) ||
           ((CY_CSDIDAC_JOIN == config->configA) && (CY_CSDIDAC_DISABLED == config->configB)) ||
           ((CY_CSDIDAC_JOIN == config->configB) && (CY_CSDIDAC_DISABLED == config->configA)) ||
           (false == Cy_CSDIDAC_IsIdacChConfigValid(config->configA)) ||
           (false == Cy_CSDIDAC_IsIdacChConfigValid(config->configB)) ||
           ((CY_CSDIDAC_JOIN == config->configA) && (CY_CSDIDAC_JOIN == config->configB)))
        {
            retVal = false;
        }
    }
    else
    {
        retVal = false;
    }

    return(retVal);
}




#ifdef __cplusplus
}
#endif /* __cplusplus */

#endif /* CY_IP_MXCSDV2 */

#endif /* CY_CSDIDAC_H */


/* [] END OF FILE */
